

#  C++核心编程



### 1. 内存分区模型

C++程序在执行时，内存大方向划分为4个区域

- 代码区：存放函数的二进制代码，由操作系统进行管理的
- 全局区：存放全局变量和静态变量以及常量
-  栈区：由编译器自动分配释放，存放函数的参数值，局部变量等
- 堆区：由程序员分配和释放，若不释放，程序执行结束后会系统回收



内存分区的意义：

- 不同区域存放的数据，赋予不同的生命周期



#### 1.1 程序运行前

程序编译后，生成可执行的 .exe 文件 未执行前，分成两个区域

代码区：

- 存放CPU执行的机器指令
- 代码区是共享的，目的是对于频繁的执行程序，只需在内存中存放一份即可
- 代码区是只读的，目的是防止程序意外的修改了它的指令

全局区：

- 全局变量和静态变量存放其中
- 全局区还包括了常量区，字符串常量和其他常量也存放其中
- 该区域的数据在程序结束后由操作系统释放



分类：

- 全局区：全局变量，静态变量，常量
- 常量区：const修饰的全局变量，字符串常量
- 局部区：局部变量，const修饰的局部变量和常量

代码：

```c++
#include <iostream>

using namespace std;

//Global variable outside Function
int g_a = 10;
int g_b = 20;

//Global constant variable outside Function
const int g_c_a = 10;
const int g_c_b = 20;

int main()
{
    //Local variable inside Function
    int l_a = 10;
    int l_b = 20;

    //Static variable
    static int s_a = 10;
    static int s_b = 20;

    //Constant Local variable inside Function
    const int l_c_a = 10;
    const int l_c_b = 20;

    //Debug local variable
    cout << "Local Area_Local variable l_a: " << (int) &l_a << endl;
    cout << "Local Area_Local variable l_b: " << (int) &l_b << endl;

    //Debug constant local variable
    cout << "Local Area_Constant local variable l_c_a:" << (int) &l_c_a << endl;
    cout << "Local Area_Constant local variable l_c_b:" << (int) &l_c_b << endl;

    //Debug global variable
    cout << "Global Area_Global variable g_a: " << (int) &g_a << endl;
    cout << "Global Area_Global variable g_b: " << (int) &g_b << endl;


      javaPage.pageFoot();
  }
  
  void cpp_demo()
  {
      CPP cpp;
      cpp.pageHeader();
      cpp.pageLeft();
      cpp.pageBody();
      cpp.pageFoot();
  }
  
  int main()
  {
      java_demo();
      cpp_demo();
      return 0;
  }
  ```



##### 4.6.2 继承的方式

- 继承语法: `class 子类 : 继承方式 父类`

- 继承方式：

  1. 公共继承：public
  2. 保护继承：protected
  3. 私有继承：private

- 继承方式演示：

  ```c++
  // 父类中的 private 可以被 子类  任何继承方式 继承；但 ！ 子类 无法 访问 和 使用
  class Father
  {
  public:
      int a;
  protected:
      int b;
  private:
      int c;
  };
  
  class Son : public Father
  {
  // public继承方式下：Father类中的 Public 和 Protected 的成员变量，在子类中 无改动；
  public:
      int a;
  protected:
      int b;
  };
  
  class Son : protected Father
  {
  // protected继承方式下：Father类中的 Public 和 Protected 的成员变量，在子类中 全为 protected
  protected:
      int a;
      int b;
  };
  
  class Son : private Father
  {
  // private继承方式下：Father类中的 Public 和 Protected 的成员变量，在子类中 全为 private
  private:
      int a;
      int b;
  };
  
  // 总结：
  // 父类的 private 可以被 任何 继承方式 继承；但 ！ 子类 无法 访问 和 使用
  // 子类通过某个 继承方式 继承 父类 后，父类中的 public，protected 中的成员变量 在子类中 以某种继承方式出现；
  ```

  

##### 4.6.3 继承中的对象模型



###### 4.6.3.1 验证子类模型

- 父类中的所有成员变量(非静态)，无论是什么权限保护的成员，都会被子类继承，但子类无法访问和使用

  ``` c++
  //
  // Created by Admin on 2021/6/22.
  //
  #include <iostream>
  
  using namespace std;
  
  class Base
  {
  public:
      int base_A;
  protected:
      int base_B;
  private:
      int base_C;
  };
  
  class Derived_1 : public Base
  {
  public:
      int derived_A;
  };
  
  void demo1()
  {
      Derived_1 derived1{};
      cout << sizeof(derived1) << endl;
  }
  
  int main()
  {
      demo1();
      return 0;
  }
  ```



###### 4.6.3.2 Developer Powershell - VS

- Visual Studio 提供的工具

- 使用方式：

  1. 首先找到上面的案例代码的所在文件位置
  2. 打开 Visual Studio 提供的 Developer Powershell
  3. 将工作路径切换到案例代码的所在文件路径
  4. 通过开发命令，查看案例代码中，子类对象的结构

- 使用步骤：

  ``` powershell
  # 切换路径 和 查看路径下 是否存在 案例代码 cpp 文件
  
  **********************************************************************
  ** Visual Studio 2019 Developer PowerShell v16.9.4
  ** Copyright (c) 2021 Microsoft Corporation
  **********************************************************************
  PS C:\Users\Admin\source\repos> D:
  PS D:\DevelopmentTool\VisualStudio\IDE> cd D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> ls
  
  
      目录: D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9
  
  
  Mode                 LastWriteTime         Length Name
  ----                 -------------         ------ ----
  -a----         2021/6/22     15:09           1515 Inherit_Base.cpp
  -a----         2021/6/22     15:42            397 Inherit_ObjectModel.cpp
  ```

  ``` powershell
  # 通过开发命令，查看案例代码中，子类对象的结构
  
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> cl /d1 reportSingleClassLayoutDerived_1 ".\Inherit_ObjectModel.cpp"
  用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
  版权所有(C) Microsoft Corporation。保留所有权利。
  
  Inherit_ObjectModel.cpp
  
  class Derived_1 size(16): # 此处可以看到 子类Derived_1对象的大小 和 之前的案例代码的打印结果一致
          +---
   0      | +--- (base class Base) # 子类Derived_1完全继承父类中所有成员 中的 base_A base_B  base_C
   0      | | base_A
   4      | | base_B
   8      | | base_C
          | +---
  12      | derived_A # 同时 子类Derived_1 自身的成员也在 derived_A
          +---
  
  # 总结：子类 Derived_1中 四个int类型的成员变量，占内存大小为16字节
  ```

  ``` powershell
  # 用到的指令
  
  # 切换盘符 到 案例代码 所在 的 盘
  D:
  
  # 切换到具体的路径地址
  cd D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9
  
  # 查看路径下 的 案例代码文件 Inherit_ObjectModel.cpp
  ls
  
  # 指定 报告单个类的布局 ：子类Deriverd_1
  # cl /d1 reportSingleClassLayout需要查看的类 "类所在的具体文件"
  cl /d1 reportSingleClassLayoutDerived_1 ".\Inherit_ObjectModel.cpp"
  ```



##### 4.6.4 继承中构造和析构顺序

- 子类继承父类之后，当创建子类对象时，也会调用父类的构造和析构函数

- 案例验证，子类和父类的构造和析构函数的调用先后顺序

  ``` c++
  //
  // Created by Admin on 2021/6/22.
  //
  #include <iostream>
  
  using namespace std;
  
  class Base
  {
  public:
      Base()
      {
          cout << "Base Constructor Transfer" << endl;
      }
  
      ~Base()
      {
          cout << "Base Destructor Transfer" << endl;
      }
  };
  
  class Derived : public Base
  {
  public:
      Derived()
      {
          cout << "Derived Constructor Transfer" << endl;
      }
  
      ~Derived()
      {
          cout << "Derived Destructor Transfer" << endl;
      }
  };
  
  void demo()
  {
      Derived derived;
  }
  
  int main()
  {
      demo();
      return 0;
  }
  ```

  ```powershell
  # 案例结果
  D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\cmake-build-debug\Code9_3.exe
  Base Constructor Transfer
  Derived Constructor Transfer
  Derived Destructor Transfer
  Base Destructor Transfer
  ```

- 由 案例结果 可以 看出

- 当创建子类时，子类和父类 的 构造和析构函数的调用 顺序

  1. 子类构造
  2. 父类构造
  3. 父类析构
  4. 子类析构



##### 4.6.5 继承同名成员处理方式

- 继承时的问题：当子类和父类出现同名成员，如何通过子类对象，访问子类或父类的同名数据

  1. 访问子类同名成员，直接访问
  2. 访问父类同名成员，添加作用域

  ```c++
  //
  // Created by Admin on 2021/6/22.
  //
  #include <iostream>
  
  using namespace std;
  
  class Base
  {
  public:
      int num;
  
      Base()
      {
          num = 100;
      }
  
      void FPrint()
      {
          cout << "Base Print" << endl;
      }
  
      void FPrint(int n)
      {
          cout << "Base Print (int n) : Overload Function" << endl;
      }
  };
  
  class Derived : public Base
  {
  public:
      int num;
  
      Derived()
      {
          num = 200;
      }
  
      void FPrint()
      {
          cout << "Derived Print" << endl;
      }
  };
  
  void demo()
  {
      Derived derived;
      cout << "Derived num = " << derived.num << endl;
      cout << "Base num = " << derived.Base::num << endl;
      derived.FPrint();
      derived.Base::FPrint();
  
      // 当父类和子类中，存在同名成员时，会默认隐藏父类的成员，所以可以直接调用子类成员，而父类成员需要 子类调用父类，在父类作用域下 调用
      // derived.FPrint(10);  // 父类被隐藏，所以直接传参也无法找到 重载的函数，因为子类没有 FPrint的重载函数
      derived.Base::FPrint(10); // 加上 父类作用域后 可调用
  }
  
  int main()
  {
      demo();
      return 0;
  }
  ```

- 解决方法：

  1. 子类对象可以直接访问到子类同名成员
  2. 子类对象加上作用域可以访问到父类同名成员
  3. 当子类和父类拥有同名的成员函数，子类会隐藏父类同名成员函数，子类加作用域可以访问到父类中同名函数



##### 4.6.6 继承同名静态成员处理方式

- 问题：继承中，同名的静态成员在子类对象上如何访问

- 静态成员和非静态成员出现同名，处理方式一致

  1. 访问子类同名成员，直接访问
  2. 访问父类同名成员，添加作用域

  ```c++
  //
  // Created by FHang on 2021/6/24 10:23
  //
  #include <iostream>
  
  using namespace std;
  
  // 基类
  class Base
  {
  public:
      static int num;
  
      static void func()
      {
          cout << "Base-Static Func" << endl;
      }
  
      ~Base()
      {
          cout << endl;
      }
  };
  
  int Base::num = 100;
  
  // 子类
  class Derived : public Base
  {
  public:
      static int num;
  
      static void func()
      {
          cout << "Derived-Static Func" << endl;
      }
  };
  
  int Derived::num = 200;
  
  // 同名静态成员属性
  void demo1()
  {
      Derived derived;
      // 通过对象访问
      cout << "通过对象访问" << endl;
      cout << "Derived Num = " << derived.num << endl;
      cout << "Base Num = " << derived.Base::num << endl;
  
      // 通过类目访问
      cout << "通过类目访问" << endl;
      cout << "Derived Num = " << Derived::num << endl;
      cout << "Base Num = " << Base::num << endl;
  
      // 第一个 :: 表示使用类名访问；第二个 :: 表示父类作用域下
      cout << "Base Num = " << Derived::Base::num << endl;
  }
  
  // 同名静态成员变量
  void demo2()
  {
      Derived derived;
      // 通过对象访问
      cout << "通过对象访问" << endl;
      derived.func();
      derived.Base::func();
  
      // 通过类目访问
      cout << "通过类目访问" << endl;
      Derived::func();
      Derived::Base::func();
  }
  
  // 当父类和子类中，存在同名成员变量时，会默认隐藏父类的成员变量，所以可以直接调用子类成员，而父类成员需要 子类调用父类，在父类作用域下 调用
  int main()
  {
      demo1();
      demo2();
      return 0;
  }
  ```

- 总结：同名静态成员处理方式和非同名静态的处理方式一样

- 区别：同名静态成员处理：

  1. 通过对象调用
  2. 通过类目调用



##### 4.6.7 多继承语法

- C++ 允许一个类继承多个类

- 语法：class 子类 : 继承方式 父类1, 继承方式 父类2...

- 多继承可能会引发父类中同名成员出现，需要加作用域区分使用

- 实际开发中，建议不用，不易于维护

  ```c++
  //
  // Created by FHang on 2021/6/24 11:03
  //
  #include <iostream>
  
  using namespace std;
  
  class Base1
  {
  public:
      int num;
  
      Base1()
      {
          num = 100;
      }
  };
  
  class Base2
  {
  public:
      int num;
  
      Base2()
      {
          num = 200;
      }
  };
  
  class Derived : public Base1, public Base2
  {
  public:
      int num;
  
      Derived()
      {
          num = 300;
      }
  };
  
  void demo()
  {
      Derived derived;
      cout << "Sizeof derived = " << sizeof(derived) << endl;
      cout << "Derived Num = " << derived.num << endl;
      cout << "Base1 Num = " << derived.Base1::num << endl;
      cout << "Base2 Num = " << derived.Base2::num << endl;
  }
  
  int main()
  {
      demo();
      return 0;
  }
  ```

- 此处也使用了 Developer PowerShell 查看了 Derived 类的结构

  ```powershell
  **********************************************************************
  ** Visual Studio 2019 Developer PowerShell v16.9.4
  ** Copyright (c) 2021 Microsoft Corporation
  **********************************************************************
  PS C:\Users\Admin\source\repos> D:
  PS D:\DevelopmentTool\VisualStudio\IDE> cd D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo> ls
  
  
      目录: D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo
  
  
  Mode                 LastWriteTime         Length Name
  ----                 -------------         ------ ----
  d-----          2021/5/4      9:34                .idea
  d-----         2021/6/24     11:12                cmake-build-debug
  d-----          2021/5/4      9:34                Code1
  d-----          2021/5/4      9:34                Code2
  d-----          2021/5/4      9:34                Code3
  d-----          2021/5/4      9:34                Code4
  d-----          2021/5/4      9:34                Code4_CirclePoint
  d-----          2021/5/4      9:34                Code5
  d-----          2021/5/4      9:34                Code6
  d-----          2021/5/4      9:34                Code7
  d-----         2021/6/20     21:27                Code8
  d-----         2021/6/24     11:11                Code9
  -a----         2021/2/21     19:24            174 .gitignore
  -a----         2021/6/24     11:12           2930 CMakeLists.txt
  
  
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo> cd Code9
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> ls
  
  
      目录: D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9
  
  
  Mode                 LastWriteTime         Length Name
  ----                 -------------         ------ ----
  -a----         2021/6/22     15:09           1515 Inherit_Base.cpp
  -a----         2021/6/22     16:36            590 Inherit_ConstructorDestructorTransferOrder.cpp
  -a----         2021/6/22     17:32           1216 Inherit_DealWithSameName.cpp
  -a----         2021/6/24     10:49           1431 Inherit_DealWithSameNameObject.cpp
  -a----         2021/6/24     11:11            126 Inherit_DiamondInheritance.cpp
  -a----         2021/6/24     11:10            730 Inherit_MoreInherit.cpp
  -a----         2021/6/22     16:01            395 Inherit_ObjectModel.cpp
  
  
  PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> cl /d1 reportSingleClassLayoutDerived ".\Inherit_MoreInherit.cpp"
  用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
  版权所有(C) Microsoft Corporation。保留所有权利。
  
  Inherit_MoreInherit.cpp
  
  class Derived   size(12):
          +---
   0      | +--- (base class Base1)
   0      | | num
          | +---
   4      | +--- (base class Base2)
   4      | | num
          | +---
   8      | num
          +---
  ```




##### 4.6.8 菱形继承

- 概念：

  1. 两个派生类继承同一个基类
  2. 又有某一个类同时继承了两个派生类

- 问题解决：

  1. 默认情况下

     ```c++
     //
     // Created by FHang on 2021/6/24 11:11
     //
     #include <iostream>
     
     using namespace std;
     
     class Animal
     {
     public:
         int age;
     
         Animal()
         {
             age = 10;
         }
     };
     
     class Tiger : public Animal{};
     
     class Lion : public Animal{};
     
     class LionTiger : public Tiger, public Lion{};
     
     void demo1()
     {
         LionTiger lionTiger;
     
         // 菱形继承，两个父类拥有相同的数据，通过作用域区分，同时造成资源浪费，通过 虚继承 解决问题
         lionTiger.Tiger::age = 20;
         lionTiger.Lion::age = 30;
     
         cout << "Tiger Age = " << lionTiger.Tiger::age << endl;
         cout << "Lion Age = " << lionTiger.Lion::age << endl;
     }
     
     int main()
     {
         demo1();
         return 0;
     }
     ```

     ```c++
     // 打印结果
     D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\cmake-build-debug\Code9_7.exe
     // 此时，可看出，LionTiger同时继承了两个成员变量，在作用域下可单独赋值
     Tiger Age = 20
     Lion Age = 30
     ```

     ```powershell
     # 利用 Developer Powershell 工具， 查看 LionTriger 类 的结构
     PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> cl /d1 reportSingleClassLayoutLionTiger ".\Inherit_DiamondInheritance.cpp"
     用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
     版权所有(C) Microsoft Corporation。保留所有权利。
     
     Inherit_DiamondInheritance.cpp
     .\Inherit_DiamondInheritance.cpp(1): warning C4819: 该文件包含不能在当前代码页(936)中表示的字符。请将该文件保存为 Unicode 格式以 防止数据丢失
     
     class LionTiger size(8): # 可以看到，LionTiger 继承了两个 重复的成员
             +---
      0      | +--- (base class Tiger)
      0      | | +--- (base class Animal)
      0      | | | age
             | | +---
             | +---
      4      | +--- (base class Lion)
      4      | | +--- (base class Animal)
      4      | | | age
             | | +---
             | +---
             +---
     ```

  2. 使用虚继承解决问题，关键字：virtual

     ```c++
     //
     // Created by FHang on 2021/6/24 11:11
     //
     #include <iostream>
     
     using namespace std;
     
     class Animal
     {
     public:
         int age;
     
         Animal()
         {
             age = 10;
         }
     };
     
     // 利用 虚继承 解决菱形继承的问题
     // 使用 关键字 virtual ，两个派生类继承同一个父类时，两个派生类 可虚拟共享同一个 父类中继承来的成员，（继承了虚基类 Animal的age 的地址）
     // Animal 类，称为 虚基类
     class Tiger : virtual public Animal{};
     
     class Lion : virtual public Animal{};
     
     class LionTiger : public Tiger, public Lion{};
     
     void demo1()
     {
         LionTiger lionTiger;
     
         // 菱形继承，两个父类拥有相同的数据，通过作用域区分，同时造成资源浪费，通过 虚继承 解决问题
         lionTiger.Tiger::age = 20;
         lionTiger.Lion::age = 30;
     
         cout << "Tiger Age = " << lionTiger.Tiger::age << endl;
         cout << "Lion Age = " << lionTiger.Lion::age << endl;
     }
     
     int main()
     {
         demo1();
         return 0;
     }
     ```

     ```c++
     // 打印结果
     D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\cmake-build-debug\Code9_7.exe
     // 使用 虚继承 后，LionTiger 只继承了一个 成员变量
     Tiger Age = 30
     Lion Age = 30
     ```

     ```powershell
     # 利用 Developer Powershell 工具， 查看 LionTriger 类 的结构 (使用了 虚继承)
     PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code9> cl /d1 reportSingleClassLayoutLionTiger ".\Inherit_DiamondInheritance.cpp"
     用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
     版权所有(C) Microsoft Corporation。保留所有权利。
     
     Inherit_DiamondInheritance.cpp
     .\Inherit_DiamondInheritance.cpp(1): warning C4819: 该文件包含不能在当前代码页(936)中表示的字符。请将该文件保存为 Unicode 格式以 防止数据丢失
     
     class LionTiger size(12):
             +---
      0      | +--- (base class Tiger)
      0      | | {vbptr} # 指向 LionTiger::$vbtable@Tiger@: 
             | +---
      4      | +--- (base class Lion)
      4      | | {vbptr} # 指向 LionTiger::$vbtable@Lion@:
             | +---
             +---
             +--- (virtual base Animal)
      8      | age
             +---
     
     LionTiger::$vbtable@Tiger@: # 偏移量 8，从类结构布局的开始 +8，刚好指向 virtual base Animal 的 成员变量 age
      0      | 0
      1      | 8 (LionTigerd(Tiger+0)Animal)
      
     LionTiger::$vbtable@Lion@: # 偏移量 4，从类结构布局的开始 +4，刚好指向 virtual base Animal 的 成员变量 age
      0      | 0
      1      | 4 (LionTigerd(Lion+0)Animal)
     vbi:       class  offset o.vbptr  o.vbte fVtorDisp
               Animal       8       0       4 0
     
     #  一些解释，上面的结构
     vbptr -> v=virtual, b=base, ptr=pointer; vbptr 指向 vbtable
     vbtable -> v=virtual, b=base, table
     ```



#### 4.7 多态



##### 4.7.1 多态的基本概念

多态是C++面向对象的三大特性之一

- 多态分为两类

  1. 静态多态：函数重载 和 运算符重载 属于静态多态，复用函数名
  2. 动态多态：派生类 和 虚函数 实现运行时，为多态

- 静态多态和动态多态的区别

  1. 静态多态的函数地址早绑定 — 编译阶段确定函数地址
  2. 动态多态的函数地址晚绑定 — 运行阶段确定函数地址

- 案例说明

  1. 静态多态

     ```c++
     //
     // Created by FHang on 2021/6/24 14:56
     //
     #include <iostream>
     
     using namespace std;
     
     class Animal
     {
     public:
         void speak()
         {
             cout << "Animal Speaking" << endl;
         }
     };
     
     class Cat : public Animal
     {
     public:
         void speak()
         {
             cout << "Cat Speaking" << endl;
         }
     };
     
     // 该函数的地址是早绑定，编译阶段确定引用的 Animal类的对象地址，后面调用时，传入Cat对象，不改变结果（静态多态）
     // 将基类Animal中的 函数 speak() 设为虚函数，运行时才确定地址，后面调用时，传入Cat对象，引用的便是Cat的对象地址（动态多态）
     void doSpeak(Animal &animal)
     {
         animal.speak();
     }
     
     void demo()
     {
         Cat cat;
         doSpeak(cat);
     }
     
     int main()
     {
         demo();
         return 0;
     }
     ```

     ```c++
     // 运行结果
     D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\cmake-build-debug\Code10_1.exe
     Animal Speaking
     ```

  2. 动态多态

     ```c++
     //
     // Created by FHang on 2021/6/24 14:56
     //
     #include <iostream>
     
     using namespace std;
     
     class Animal
     {
     public:
         // 使用关键字 virtual，使得变成虚函数
         virtual void speak()
         {
             cout << "Animal Speaking" << endl;
         }
     };
     
     class Cat : public Animal
     {
     public:
         void speak()
         {
             cout << "Cat Speaking" << endl;
         }
     };
     
     class Dog : public Animal
     {
     public:
         void speak()
         {
             cout << "Dog Speaking" << endl;
         }
     };
     
     // 该函数内传入引用对象调用的speak()函数的地址是早绑定，编译阶段确定引用的 Animal类的对象地址，后面调用时，传入Cat对象，不改变结果（静态多态）
     // 将基类Animal中的 函数 speak() 设为虚函数，运行时才确定地址，后面调用时，传入Cat对象，引用的便是Cat的对象地址（动态多态）
     void doSpeak(Animal &animal)
     {
         // speak()早绑定时，默认是传入基类Animal的引用对象地址
         // speak()使用virtual后是晚绑定时，传入指定引用对象地址
         animal.speak();
     }
     
     void demo()
     {
         Cat cat;
         Dog dog;
         doSpeak(cat);
         doSpeak(dog);
     }
     
     int main()
     {
         demo();
         return 0;
     }
     ```
     
     ```c++
     // 运行结果
     D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\cmake-build-debug\Code10_1.exe
     Cat Speaking
     Dog Speaking
     ```
  
- 动态多态的满足条件

  1. 有继承关系
  2. 子类重写父类的虚函数
  3. 重写：函数返回值类型，函数名，参数列表，完全一致

- 动态多态的使用：父类的指针或引用，执行子类对象



##### 4.7.2 多态深入原理

案例代码

```c++
//
// Created by FHang on 2021/6/24 14:56
//
#include <iostream>

using namespace std;

class Animal
{
public:
    virtual void speak()
    {
        cout << "Animal Speaking" << endl;
    }
};

class Cat : public Animal
{
public:
    void speak()
    {
        cout << "Cat Speaking" << endl;
    }
};

class Dog : public Animal
{
public:
    void speak()
    {
        cout << "Dog Speaking" << endl;
    }
};

void doSpeak(Animal &animal) // 此处 => Animal &animal = cat
{
    animal.speak();
}

void demo()
{
    Cat cat;
    Dog dog;
    doSpeak(cat); 
    doSpeak(dog);
}

int main()
{
    demo();
    return 0;
}
```

- 静态多态

  - 基类 Animal 中的 speak() 没有 virtual 前是早绑定，函数地址在类外，此时Animal类是空类，大小为1；

- 动态多态

  - 基类 Animal 中的 speak() 有 virtual 是晚绑定，函数地址在类内，此时Animal类不是空类，大小为4；

  - 此时 虚函数speak()，在类内中是 vfptr = virtualFunctionPointer ( 虚函数(表)指针 )，指向vftable (虚函数表)，函数地址入口是 &Animal::speak;
  - 子类Cat继承Animal后，默认情况下，Cat类完全继承了Animal类的属性；
  - 但案例代码中，Cat类内实现了speak()的重写，此时函数地址入口是 &Cat::speak;
  - 子类中的虚函数表内部会替换成子类的虚函数地址；
  - 此时，当父类的指针或引用指向子类对象时，发生多态；

- 验证：Developer PowerShell

  - 静态多态

    ```powershell
    # 基类Animal 的函数表
    PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code10> cl /d1 reportSingleClassLayoutAnimal ".\Polymorphism_DeepUnderlying.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    Polymorphism_DeepUnderlying.cpp
    
    class Animal    size(1):
            +---
            +---
    ```

    ```powershell
    PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code10> cl /d1 reportSingleClassLayoutCat ".\Polymorphism_DeepUnderlying.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    Polymorphism_DeepUnderlying.cpp
    
    class _s__CatchableType size(28):
            +---
     0      | properties
     4      | pType
     8      | _PMD thisDisplacement
    20      | sizeOrOffset
    24      | copyFunction
            +---
    
    class _s__CatchableTypeArray    size(4):
            +---
     0      | nCatchableTypes
     4      | arrayOfCatchableTypes
            +---
    
    class Cat       size(1):
            +---
     0      | +--- (base class Animal) #基类没有实现虚函数，为静态多态时，子类完全继承基类，即使子类重写了speak，也依然是默认的基类对象引用
            | +---
            +---
    ```

    

  - 动态多态

    ```powershell
    # 基类Animal 的函数表
    PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code10> cl /d1 reportSingleClassLayoutAnimal ".\Polymorphism_DeepUnderlying.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    Polymorphism_DeepUnderlying.cpp
    
    class Animal    size(4):
            +---
     0      | {vfptr}
            +---
    
    Animal::$vftable@:
            | &Animal_meta
            |  0
     0      | &Animal::speak
    
    Animal::speak this adjustor: 0
    ```

    ```powershell
    # 子类Cat 没有发生重写时的 函数表
    PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code10> cl /d1 reportSingleClassLayoutCat ".\Polymorphism_DeepUnderlying.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    Polymorphism_DeepUnderlying.cpp
    
    class _s__CatchableType size(28):
            +---
     0      | properties
     4      | pType
     8      | _PMD thisDisplacement
    20      | sizeOrOffset
    24      | copyFunction
            +---
    
    class _s__CatchableTypeArray    size(4):
            +---
     0      | nCatchableTypes
     4      | arrayOfCatchableTypes
            +---
    
    class Cat       size(4):
            +---
     0      | +--- (base class Animal)
     0      | | {vfptr}
            | +---
            +---
    
    Cat::$vftable@:
            | &Cat_meta
            |  0
     0      | &Animal::speak # Cat内没有重写 speak 时，Cat类的函数指针指向的函数表是 Animal 的
    ```

    ```powershell
    # 子类Cat 发生重写时的 函数表
    PS D:\Learn\Cpp\3_Cpp_plus_Clion\CodeDemo\Code10> cl /d1 reportSingleClassLayoutCat ".\Polymorphism_DeepUnderlying.cpp"
    用于 x86 的 Microsoft (R) C/C++ 优化编译器 19.28.29914 版
    版权所有(C) Microsoft Corporation。保留所有权利。
    
    Polymorphism_DeepUnderlying.cpp
    
    class _s__CatchableType size(28):
            +---
     0      | properties
     4      | pType
     8      | _PMD thisDisplacement
    20      | sizeOrOffset
    24      | copyFunction
            +---
    
    class _s__CatchableTypeArray    size(4):
            +---
     0      | nCatchableTypes
     4      | arrayOfCatchableTypes
            +---
    
    class Cat       size(4):
            +---
     0      | +--- (base class Animal)
     0      | | {vfptr}
            | +---
            +---
    
    Cat::$vftable@:
            | &Cat_meta
            |  0
     0      | &Cat::speak  # Cat内重写 speak 后，Cat类的函数指针指向的函数表是 Cat 的
    
    Cat::speak this adjustor: 0
    ```



##### 4.7.3 多态案例-计算器

- 案例描述：分别使用普通的方法和多态，设计实现两个操作数进行运算的计算器类

- 多态的优点：

  - 代码组织结构清晰
  - 可读性强
  - 利于前期和后期的扩展和维护

- 示例：普通实现

  ```c++
  //
  // Created by FHang on 2021/6/24 16:39
  //
  #include <iostream>
  
  using namespace std;
  
  class Calculator
  {
  public:
      int num1;
      int num2;
  
      float getResult(string f_operator)
      {
          if (f_operator == "+")
          {
              return num1 + num2;
          }
          if (f_operator == "-")
          {
              return num1 - num2;
          }
          if (f_operator == "*")
          {
              return num1 * num2;
          }
      }
  };
  
  void demo()
  {
      Calculator calculator{};
